app/controllers/twitter_controller.rb

  def index
    @twitter = @wrapper.get_twitter
    if @twitter
      @account = @twitter.user_timeline.first.user.screen_name
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1