app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    if current_user && current_user.admin
      @users = User.all

INSERT INTO `users` (`salt`, `created_at`, `access_secret`, `updated_at`, `password_hash`, `email`, `access_token`) VALUES('4ecb664be48174770573acbd28ccabf404ee9a9c', '2010-06-21 03:35:37', NULL, '2010-06-21 03:35:37', 'dbd13afca2f9d52e7d7bc1223528446a34ddf51a', 'pmtl3000@gmail.com', NULL)
---
  def create
    @user = User.new params[:user]
    if @user.save